/////// EUROCODE Steel Moment Bolt Connection
IDC_GESMC_CHKDATA_SECT_GIRDER_NO1             = "유효하지 않은 거더의 개수 : 거더의 개수 < 1"
IDC_GESMC_CHKDATA_SECT_GIRDER_NO2             = "유효하지 않은 거더의 개수 : 거더의 개수 > 2"
IDC_GESMC_CHKDATA_SECT_COLUMN_NO1             = "유효하지 않은 기둥의 개수 : 기둥의 개수 < 1"
IDC_GESMC_CHKDATA_SECT_COLUMN_NO2             = "유효하지 않은 기둥의 개수 : 기둥의 개수 > 2"

IDC_GESMC_CHKDATA_SECT_ANGLE0                 = "유효하지 않은 각도 : 각도 < 0.0"
IDC_GESMC_CHKDATA_SECT_ANGLE360               = "유효하지 않은 각도 : 각도 > 360.0"
IDC_GESMC_CHKDATA_SECT_ANGLE_MINUS90          = "유효하지 않은 각도 : 각도 < -90.0"
IDC_GESMC_CHKDATA_SECT_ANGLE_PLUS90           = "유효하지 않은 각도 : 각도 > 90.0"
IDC_GESMC_CHKDATA_SECT_WELD_WEB_MIN           = "유효하지 않은 용접 목두께 : 웨브 두께 < 0.0"
IDC_GESMC_CHKDATA_SECT_WELD_WEB_MAX           = "유효하지 않은 용접 목두께 : 웨브 두께 > MAX."
IDC_GESMC_CHKDATA_SECT_WELD_FLG_MIN           = "유효하지 않은 용접 목두께 : 플랜지 두께 < 0.0"
IDC_GESMC_CHKDATA_SECT_WELD_FLG_MAX           = "유효하지 않은 용접 목두께 : 플랜지 두께 > MAX."
IDC_GESMC_CHKDATA_SECT_THROAT_THICK           = "\n용접 목두께 = (다리길이) / √2"

IDC_GESMC_CHKDATA_BRACKET_TYPE                = "유효하지 않은 브라켓 유형 : H-단면 또는 플레이트를 선택하세요."
IDC_GESMC_CHKDATA_BRACKET_PLATE_THK_MIN       = "유효하지 않은 브라켓 두께 : 두께 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_PLATE_THK_MAX       = "유효하지 않은 브라켓 두께 : 두께 > MAX."
IDC_GESMC_CHKDATA_BRACKET_LENGTH_MIN          = "유효하지 않은 브라켓 길이 : 길이 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_LENGTH_MAX          = "유효하지 않은 브라켓 길이 : 길이 > MAX."
IDC_GESMC_CHKDATA_BRACKET_HEIGHT1_MIN         = "유효하지 않은 브라켓 높이 : 높이1 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_HEIGHT1_MAX         = "유효하지 않은 브라켓 높이 : 높이1 > MAX."
IDC_GESMC_CHKDATA_BRACKET_HEIGHT2_MIN         = "유효하지 않은 브라켓 높이 : 높이2 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_HEIGHT2_MAX         = "유효하지 않은 브라켓 높이 : 높이2 > MAX."
IDC_GESMC_CHKDATA_SECT_CLASS_NO               = "유효하지 않은 단면 분류 : 1, 2, 3, 4중에서 선택하세요."
IDC_GESMC_CHKDATA_SECT_MODULUS0               = "유효하지 않은 단면 계수 : 단면 계수 < 0"

IDC_GESMC_CHKDATA_END_PLATE_THK_MIN           = "유효하지 않은 엔드 플레이트 두께 : 두께 < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_THK_MAX           = "유효하지 않은 엔드 플레이트 두께 : 두께 > MAX."
IDC_GESMC_CHKDATA_END_PLATE_WID_MIN           = "유효하지 않은 엔드 플레이트 너비 : 너비 < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_WID_MAX           = "유효하지 않은 엔드 플레이트 너비 : 너비 > MAX."
IDC_GESMC_CHKDATA_END_PLATE_EXTOP_MIN         = "유효하지 않은 엔드 플레이트 연장 길이 : 상부 < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_EXTOP_MAX         = "유효하지 않은 엔드 플레이트 연장 길이 : 상부 > MAX."
IDC_GESMC_CHKDATA_END_PLATE_EXBOT_MIN         = "유효하지 않은 엔드 플레이트 연장 길이 : 하부 < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_EXBOT_MAX         = "유효하지 않은 엔드 플레이트 연장 길이 : 하부 > MAX."

IDC_GESMC_CHKDATA_WEB_STIF_TYPE               = "유효하지 않은 기둥 웨브 스티프너의 유형"
IDC_GESMC_CHKDATA_WEB_STIF_SIDE_NO1           = "유효하지 않은 기둥 웨브 스티프너의 설치면수 : 설치면수 < 1"
IDC_GESMC_CHKDATA_WEB_STIF_SIDE_NO2           = "유효하지 않은 기둥 웨브 스티프너의 설치면수 : 설치면수 > 2"
IDC_GESMC_CHKDATA_WEB_STIF_THK_MIN            = "유효하지 않은 기둥 웨브 스티프너 : 두께 < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_THK_MAX            = "유효하지 않은 기둥 웨브 스티프너 : 두께 > MAX."
IDC_GESMC_CHKDATA_WEB_STIF_WIDTH_MIN          = "유효하지 않은 기둥 웨브 스티프너 : 너비 < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_WIDTH_MAX          = "유효하지 않은 기둥 웨브 스티프너 : 너비 > MAX."
IDC_GESMC_CHKDATA_WEB_STIF_HEIGHT_MIN         = "유효하지 않은 기둥 웨브 스티프너 : 높이 < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_HEIGHT_MAX         = "유효하지 않은 기둥 웨브 스티프너 : 높이 > MAX."

IDC_GESMC_CHKDATA_FLG_STIF_THK_MIN            = "유효하지 않은 스티프너 : 두께 < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_THK_MAX            = "유효하지 않은 스티프너 : 두께 > MAX."
IDC_GESMC_CHKDATA_FLG_STIF_WIDTH_MIN          = "유효하지 않은 스티프너 : 너비 < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_WIDTH_MAX          = "유효하지 않은 스티프너 : 너비 > MAX."
IDC_GESMC_CHKDATA_FLG_STIF_CORNER_MIN         = "유효하지 않은 스티프너 : 모서리 반경 < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_CORNER_MAX         = "유효하지 않은 스티프너 : 모서리 반경 > MAX."

IDC_GESMC_CHKDATA_SHEAR_ROW_DESIGNATION       = "유효하지 않은 전단 열 지정 방식 : 자동 또는 수동을 선택하세요."
IDC_GESMC_CHKDATA_BOLT_TYPE                   = "유효하지 않은 볼트 유형 : 표준 볼트나 민머리 볼트를 선택하세요."
IDC_GESMC_CHKDATA_BOLT_LAYOUT_TYPE            = "유효하지 않은 볼트 배치 유형 : 자동 배치 또는 수동 배치를 선택하세요."
IDC_GESMC_CHKDATA_BOLT_SLIP_FACT_MIN          = "유효하지 않은 볼트 마찰 계수 : 마찰 계수 < 0.0"
IDC_GESMC_CHKDATA_BOLT_SLIP_FACT_MAX          = "유효하지 않은 볼트 마찰 계수 : 마찰 계수 > 1.0"
IDC_GESMC_CHKDATA_BOLT_ROW_IN_TOP_EXTENSION   = "유효하지 않은 볼트 배치 : 상부 연장부내의 볼트 열의 수 > 1"

IDC_GESMC_CHKDATA_BOLT_AUTO_COLUMN            = "유효하지 않은 볼트 배치 열수 : 배치 열수는 2입니다."
IDC_GESMC_CHKDATA_BOLT_AUTO_ROW_TOP           = "유효하지 않은 볼트 배치 행수 : 상부 < 1"
IDC_GESMC_CHKDATA_BOLT_AUTO_ROW_BOT           = "유효하지 않은 볼트 배치 행수 : 하부 < 1"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTHOR_MIN        = "유효하지 않은 볼트 배치 연단 거리 : 수평 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTHOR_MAX        = "유효하지 않은 볼트 배치 연단 거리 : 수평 > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTVER_MIN        = "유효하지 않은 볼트 배치 연단 거리 : 수직 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTVER_MAX        = "유효하지 않은 볼트 배치 연단 거리 : 수직 > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTTOP_MIN        = "유효하지 않은 볼트 배치 연단 거리 : 수직 ( 상부 ) < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTTOP_MAX        = "유효하지 않은 볼트 배치 연단 거리 : 수직 ( 상부 ) > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTBOT_MIN        = "유효하지 않은 볼트 배치 연단 거리 : 수직 ( 하부 ) < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTBOT_MAX        = "유효하지 않은 볼트 배치 연단 거리 : 수직 ( 하부 ) > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEV_MIN        = "유효하지 않은 볼트 배치 간격 : 수직 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEV_MAX        = "유효하지 않은 볼트 배치 간격 : 수직 > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEH_MIN        = "유효하지 않은 볼트 배치 간격 : 수평 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEH_MAX        = "유효하지 않은 볼트 배치 간격 : 수평 > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_OFFSET_MIN        = "유효하지 않은 볼트 배치 띄움 거리 : 뛰움 거리 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_OFFSET_MAX        = "유효하지 않은 볼트 배치 띄움 거리 : 뛰움 거리 > MAX."

IDC_GESMC_CHKDATA_BOLT_USER_COLUMN            = "유효하지 않은 볼트 배치 열수 : 배치 열수는 2입니다."
IDC_GESMC_CHKDATA_BOLT_USER_SPACEH_MIN        = "유효하지 않은 볼트 배치 간격 : 수평 < 0.0"
IDC_GESMC_CHKDATA_BOLT_USER_SPACEH_MAX        = "유효하지 않은 볼트 배치 간격 : 수평 > MAX."
IDC_GESMC_CHKDATA_BOLT_USER_TOP_NONE          = "유효하지 않은 볼트 배치 : 상부의 배치 정보가 없습니다."
IDC_GESMC_CHKDATA_BOLT_USER_TOP_ZERO          = "유효하지 않은 볼트 배치 : 상부에 위치가 0인 정보가 존재합니다."
IDC_GESMC_CHKDATA_BOLT_USER_BOT_NONE          = "유효하지 않은 볼트 배치 : 하부의 배치 정보가 없습니다."
IDC_GESMC_CHKDATA_BOLT_USER_BOT_ZERO          = "유효하지 않은 볼트 배치 : 하부에 위치가 0인 정보가 존재합니다."

IDC_GESMC_CHKDATA_FORC_EMPTY                  = "유효하지 않은 하중 조합 : 하중 조합 정보가 없습니다."
IDC_GESMC_CHKDATA_FORC_UNEQUAL                = "유효하지 않은 하중 조합 : 하중 조합의 개수가 동일하지 않습니다."
IDC_GESMC_CHKDATA_FORC_NOT_SELECT             = "유효하지 않은 하중 조합 : 선택된 하중 조합이 없습니다."

IDC_GESMC_CHKDATA_FACT_MIN                    = "유효하지 않은 감소 계수 : 감소 계수 < 0.0"
IDC_GESMC_CHKDATA_FACT_MAX                    = "유효하지 않은 감소 계수 : 감소 계수 > MAX."

IDC_GESMC_CHKDATA_DISP_TYPE                   = "유효하지 않은 삽도 유형"

IDS_EC_TB_NAME_CHECK_ITEMS                    = "검토 항목"
IDS_EC_TB_NAME_VALUE                          = "발생값"
IDS_EC_TB_NAME_CRITERIA                       = "기준값"
IDS_EC_TB_NAME_REMARK                         = "비고"
IDS_EC_TB_NAME_GIRDER_FLG                     = "거더 플랜지"
IDS_EC_TB_NAME_GIRDER_WEB                     = "거더 웨브"
IDS_EC_TB_NAME_HAUNCH_FLG                     = "헌치 플랜지"
IDS_EC_TB_NAME_HAUNCH_WEB                     = "헌치 웨브"
IDS_EC_TB_NAME_RESISTANCE_CHK                 = "강도 검토"
IDS_EC_TB_NAME_WELDTHICK_CHK                  = "용접 목두께 검토"

IDS_EC_TB_NAME_DESIGN_METHOD_EAM              = "유효 면적법"
IDS_EC_TB_NAME_DESIGN_METHOD_FEM              = "유한 요소법"
IDC_EC_TB_NAME_WELD_CHECK                     = "용접 검토"